Merge branch 'main' into feat-duplicate-metrics
